from xml.dom.minidom import ProcessingInstruction

Ex="Топинамбур"
print(Ex[0])
print(Ex[-1])
print(Ex[5:])
print(Ex[::-1])
print(Ex[1:10][:: 2])
#Выведите на экран(в консоль) первый символ этой строки.
#Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
#Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
#Выведите на экран(в консоль) это слово наоборот.
#ыведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')